STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_RC_LongRange_Peripheral/STM32_BLE/App/app_ble.c
/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  if(bleAppContext.Device_Connection_Status == APP_BLE_ADV_CODED_PHY)
  {
    /* Stop the ongoing advertising to start the advertisement with Coded PHY */
    APP_DBG_MSG("  Stop the ongoing advertising to start the advertisement with 1M\n");
    HAL_RADIO_TIMER_StopVirtualTimer(&bleAppContext.Advertising_mgr_timer_Id);
    Adv_Cancel();
  }
  else
  {
    if(bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
    {
      APP_DBG_MSG("Terminate the connection with the central device.\n");
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_CONN_TERMINATE);
      //bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }
  
  if (bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    APP_DBG_MSG("Relaunch advertising\n");
    /* Relaunch advertising */
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
    HAL_RADIO_TIMER_StartVirtualTimer(&bleAppContext.Advertising_mgr_timer_Id, ADV_TIMEOUT_MS);
    /* 1M Led3 Off */
    BSP_LED_Off(LD3);
  }
  else
  {
    
      APP_DBG_MSG(" ---------------------------   bleAppContext.Device_Connection_Status   0x%02X\n", bleAppContext.Device_Connection_Status);
  }

  return;
}

void APPE_Button2Action(void)
{
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
  {
    APP_BLE_Procedure_Gap_General(PROC_GAP_GEN_PHY_TOGGLE_CODED);
  }
  return;
}


void APPE_Button2ActionLong(void)
{
  if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER)
  {
    UTIL_SEQ_SetTask( 1<<CFG_TASK_SEND_NOTIF_ID, CFG_SEQ_PRIO_0);
  }
  return;
}


void APPE_Button3Action(void)
{
  
  if (bleAppContext.Device_Connection_Status == APP_BLE_ADV_FAST || bleAppContext.Device_Connection_Status == APP_BLE_ADV_LP )
  {
    /* Stop the ongoing advertising to start the advertisement with Coded PHY */
    APP_DBG_MSG("  Stop the ongoing advertising to start the advertisement with Coded PHY\n");
    HAL_RADIO_TIMER_StopVirtualTimer(&bleAppContext.Advertising_mgr_timer_Id);
    Adv_Cancel();
  }
  else
  {
    if (bleAppContext.Device_Connection_Status == APP_BLE_CONNECTED_SERVER )
    {
      APP_DBG_MSG("Terminate the connection with the central device.\n");
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_CONN_TERMINATE);
      bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    }
  }
  
  /* Relaunch advertising with Coded Phy */
  if (bleAppContext.Device_Connection_Status == APP_BLE_IDLE)
  {
    APP_DBG_MSG("(CODED PHY) Relaunch advertising\n");
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_CODED_PHY);
    /* Coded Phy Led3 On */
    BSP_LED_Off(LD3);
  }
  
  return;
}

#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
